using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace Aruuz.Models
{
    public class Meters
    {
        static public int numMeters = 129;
        static public int numVariedMeters = 0;
        static public int numRubaiMeters = 12;
        static public int numSpecialMeters = 11;

        #region regular meters
        static public int[] id = 
        {13,14,15,16,17,2,2,4,4,4,4,18,19,3,3,20,21,22,23,5,5,5,24,25,26,27,6,6,6,6,30,31,32,33,34,35,35,35,35,36,40,41,42,43,44,45,46,47,48,49,50
        ,51,52,53,54,55,56,57,58,59,60,61,62,63,7,103,64,65,8,8,8,8,9,9,9,9,10,10,66,67,68,69,70,71,72,73,74,75,76,77,1,1,1,1,11,11,78,79,80,81,12,12,12,12,12
        ,82,83,84,85,86,87,88,89,90,91,92,93,94,95,36,96,97,98,99,100,101,102,103,104};

        static public int[] usage =
        {1,
1,
1,
1,
1,
1,
1,
1,
0,
0,
0,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
0,
0,
0,
1,
0,
1,
0,
1,
0,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
0,
0,
0,
0,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1,
1
        };

        static public string[] meters = {"-===/-===/-===/-===",
"-===/-===/-===/-==",
"-=-=/-=-=/-=-=/-=-=",
"=-=/-===+=-=/-===",
"-=-=/-===/-=-=/-===",
"==-/-==-/-==-/-===",
"==-/-===+==-/-===",
"==-/-==-/-==-/-==",
"===/==-/-==-/-==",
"==-/-===/==-/-==",
"==-/-==-/-===/==",
"-===/-===/-===",
"-===/-===/-==",
"==-/-=-=/-==",
"===/=-=/-==",
"=-=/-=-=+=-=/-=-=",
"-===/-==",
"-===/-==+-===/-==",
"==-=/==-=/==-=/==-=",
"=--=/=--=/=--=/=--=",
"=--=/-=-=+=--=/-=-=",
"-=-=/=--=+-=-=/=--=",
"==-=/==-=/==-=",
"=--=/=--=/=--=",
"=-==/=-==/=-==/=-==",
"=-==/=-==/=-==/=-=",
"=-==/--==/--==/--=",
"--==/--==/--==/--=",
"=-==/--==/--==/==",
"--==/--==/--==/==",
"--=-/=-==+--=-/=-==",
"==-/=-==+==-/=-==",
"--==/--==/--==/--==",
"=-==/=-==/=-==",
"=-==/=-==/=-=",
"=-==/--==/--=",
"=-==/--==/==",
"--==/--==/--=",
"--==/--==/==",
"--==/--==/--==",
"-==/-==/-==/-==",
"-==/-==/-==/-==/-==/-==/-==/-==",
"-==/-==/-==/-=",
"=-/-=-/-=-/-==",
"=-/-=-/-=-/-=",
"=-/-=-/-=-/-=-/-=-/-=-/-=-/-=",
"=-/-=-/-=-/-=-/-=-/-=-/-=-/-==",
"-==/-==/-==",
"-==/-==/-=",
"==/-==/==/-==",
"=-=/=-=/=-=/=-=",
"--=/--=/--=/--=",
"--=/--=/--=/--=/--=/--=/--=/--=",
"=-=/=-=/=-=/--=",
"=-=/=-=/=-=",
"=-=/-=/=-=/-=",
"--=-=/--=-=/--=-=/--=-=",
"--=-=/--=-=/--=-=",
"-=--=/-=--=/-=--=/-=--=",
"-=--=/-=--=/-=--=",
"-=--=/-=--=/-==",
"-===/=-==/-===/=-==",
"-==-/=-=-/-==-/=-=",
"==-/=-==/==-/=-==",
"==-/=-=-/-==-/=-=",
"==-/=-==/==-/=-=",
"==-/=-=-/-===",
"==-=/=-==/==-=/=-==",
"-=-=/--==/-=-=/--==",
"-=-=/===/-=-=/--==",
"-=-=/--==/-=-=/===",
"-=-=/===/-=-=/===",
"-=-=/--==/-=-=/--=",
"-=-=/===/-=-=/--=",
"-=-=/--==/-=-=/==",
"-=-=/===/-=-=/==",
"-=-=/--==/-=-=",
"-=-=/===/-=-=",
"==-=/===-/==-=/===-",
"=--=/=-=+=--=/=-=",
"=--=/=-=-/=--=/=",
"=--=/=-=/=--=",
"===-/==-=/===-/==-=",
"=-=-/=--=/=-=-/=--=",
"==-=/==-=/===-",
"=--=/=--=/=-=",
"==-=/==-=/-==",
"=-==/==-=/=-==/==-=",
"=-==/==-=/=-==",
"--==/-=-=/--==",
"=-==/-=-=/--=",
"--==/-=-=/--=",
"=-==/-=-=/==",
"--==/-=-=/==",
"=-==/-=-=/=",
"--==/-=-=/=",
"-===/-==/-===",
"-==/-===/-==/-=-=",
"-==/-=-=/-==/-=-=",
"=-==/=-=/=-==/=-=",
"--==/--=/--==/--=",
"--==/==/--==/--=",
"===/--=/--==/--=",
"--==/--=/===/--=",
"--==/--=/--==/==",
"=-==/--=/=-==/--=",
"==-=/=-=/==-=/=-=",
"-=-=/--=/-=-=/--=",
"-===/-===/=-==",
"==-/-==-/=-==",
"=-==/=-==/==-=",
"--==/--==/-=-=",
"=-==/-===/-===",
"=-=-/-==-/-==",
"-=-==/-=-==/-=-==/-=-==",
"=-=/-===",
"=-=/-=-=",
"-===/-===",
"-=-=/-=-=/-=-=/-=",
"=-==/--==/--==",
"-===/-===",
"=-==/=-==",
"=-==/=-=",
"-==/-==",
"--=-=/--=-=",
"-==/-===",
"=-==/=-=",
"-===/-===/-===/-===/-===/-===/-===/-===",
"-=-==/-=-=="
                                        };
        static public string[] meterNames = {
            "ہزج مثمن سالم",
"ہزج مثمن محذوف",
"ہزج مثمن مقبوض",
"ہزج مثمن اشتر",
"ہزج مثمن مقبوض سالم",
"ہزج مثمن اخرب مکفوف سالم",
"ہزج مثمن اخرب سالم", 
"ہزج مثمن اخرب مکفوف محذوف", 
"ہزج مثمن اخرب مکفوف محذوف",
"ہزج مثمن اخرب مکفوف محذوف",
"ہزج مثمن اخرب مکفوف محذوف",
"ہزج مسدس سالم",
"ہزج مسدس محذوف",
"ہزج مسدس اخرب مقبوض محذوف", 
"ہزج مسدس اخرم اشتر محذوف",
"ہزج مربع اشتر مقبوض مضاعف",
"ہزج مربع محذوف",
"ہزج مربع محذوف مضاعف", 
"رجز مثمن سالم",
"رجز مثمن مطوی",
"رجز مثمن مطوی مخبون", 
"رجز مثمن مخبون مطوی",
"رجز مسدس سالم",
"رجز مسدس مطوی",
"رمل مثمن سالم",
"رمل مثمن محذوف",
"رمل مثمن سالم مخبون محذوف", 
"رمل مثمن سالم مخبون محذوف",
"رمل مثمن مخبون محذوف مقطوع",
"رمل مثمن مخبون محذوف مقطوع",
"رمل مثمن مشکول",
"رمل مثمن مشکول مسکّن",
"رمل مثمن مخبون",
"رمل مسدس سالم",
"رمل مسدس محذوف",
"رمل مسدس مخبون محذوف", 
"رمل مسدس مخبون محذوف مسکن", 
"رمل مسدس مخبون محذوف", 
"رمل مسدس مخبون محذوف مسکن", 
"رمل مسدس مخبون", 
"متقارب مثمن سالم",
"متقارب مثمن سالم مضاعف", 
"متقارب مثمن محذوف",
"متقارب مثمن اثرم مقبوض", 
"متقارب مثمن اثرم مقبوض محذوف", 
"متقارب مثمن اثرم مقبوض مضاعف",
"متقارب مثمن اثرم مقبوض محذوف مضاعف", 
"متقارب مسدس سالم",
"متقارب مسدس محذوف",
"متقارب مربع اثلم سالم مضاعف", 
"متدارک مثمن سالم",
"متدارک مثمن مخبون",
"متدارک مثمن مخبون مضاعف", 
"متدارک مثمن سالم مقطوع",
"متدارک مسدس سالم",
"متدارک مربع مخلع مضاعف", 
"کامل مثمن سالم",
"کامل مسدس سالم",
"وافر مثمن سالم",
"وافر مسدس سالم",
"وافر مسدس مقطوف", 
"مضارع مثمن سالم",
"مضارع مثمن مکفوف محذوف", 
"مضارع مثمن اخرب",
"مضارع مثمن اخرب مکفوف محذوف", 
"مضارع مثمن اخرب محذوف",
"مضارع مسدس اخرب مکفوف",
"مجتث مثمن سالم",
"مجتث مثمن مخبون",
"مجتث مثمن مخبون",
"مجتث مثمن مخبون",
"مجتث مثمن مخبون",
"مجتث مثمن مخبون محذوف", 
"مجتث مثمن مخبون محذوف",
"مجتث مثمن مخبون محذوف مسکن", 
"مجتث مثمن مخبون محذوف مسکن",
"مجتث مسدس مخبون",
"مجتث مسدس مخبون",
"منسرح مثمن سالم",
"منسرح مثمن مطوی مکسوف", 
"منسرح مثمن مطوی منحور",
"منسرح مسدس مطوی مکسوف",
"مقتضب مثمن سالم",
"مقتضب مثمن مطوی",
"سریع مسدس سالم",
"سریع مسدس مطوی مکسوف", 
"سریع مسدس مخبون مکسوف ",
"خفیف مثمن سالم",
"خفیف مسدس سالم",
"خفیف مسدس مخبون",
"خفیف مسدس مخبون محذوف", 
"خفیف مسدس مخبون محذوف",
"خفیف مسدس مخبون محذوف مقطوع", 
"خفیف مسدس مخبون محذوف مقطوع",
"خفیف مسدس سالم مخبون محجوف",
"خفیف مسدس مخبون محجوف",
"طویل مثمن سالم",
"طویل مثمن سالم مقبوض", 
"طویل مثمن مقبوض",
"مدید مثمن سالم",
"مدید مثمن مخبون",
"مدید مثمن مخبون",
"مدید مثمن مخبون",
"مدید مثمن مخبون",
"مدید مثمن مخبون",
"مدید مثمن سالم مخبون", 
"بسیط مثمن سالم",
"بسیط مثمن مخبون",
"قریب مسدس سالم",
"قریب مسدس اخرب مکفوف", 
"جدید مسدس سالم",
"جدید مسدس مخبون",
"مشاکل مسدس سالم",
"مشاکل مسدس مکفوف محذوف", 
"جمیل مثمن سالم",
"ہزج مربع اشتر",
"ہزج مربع اشتر مقبوض",
"ہزج مربع سالم",
"ہزج مثمن مقبوض محذوف",
"رمل مسدس مخبون",
"ہزج مربع سالم",
"رمل مربع سالم",
"ہزج مربع محذوف",
"متقارب مربع سالم",
"کامل مربع سالم",
"طویل مربع سالم",
"مدید مربع سالم",
"ہزج مثمن سالم مضاعف",
"جمیل مربع سالم"
 };

        #endregion

        static public string[] metersVaried = {"--==/-=-=/==","--==/-=-=/--=","--==/--==/==","--==/--==/--=","--==/--==/--==/==",
                                "--==/--==/--==/--=","--==/--==/--=="}; // Meters 14-19 have variations in which the first long syllable could be replaced by one short syllable
        static public string[] rubaiMeters = {"==-/-==-/-==-/-=","==-/-==-/-===/=","==-/-=-=/-===/=","==-/-=-=/-==-/-=",
                                "===/=-=/-==-/-=","===/=-=/-===/=","==-/-===/===/=","==-/-===/==-/-=",
                                "===/===/==-/-=","===/===/===/=","===/==-/-===/=","===/==-/-==-/-="};
        static public string[] specialMeters = { "=(=)/=(=)/=(=)/=(=)/=(=)/=(=)/=(=)/=",
                                                   "=(=)/=(=)/=(=)/=(=)/=(=)/=",
                                                   "=(=)/=(=)/=(=)/=(=)/=(=)/=(=)/=(=)/==",
                                                   "=(=)/=(=)/=(=)/=",
                                                   "=(=)/=(=)/=(=)/==",
                                                   "=(=)/=(=)/=",
                                                   "=(=)/=(=)/=(=)/=(=)/=(=)/==",
                                                   "=(=)/=(=)",
                                                   "(=)=/(=)=/(=)=/(=)=/(=)=/(=)=/(=)=/(=)=",
                                                   "(=)=/(=)=/(=)=/(=)=/(=)=/(=)=",
                                                   "(=)=/(=)=/(=)=/(=)" };
        static public string[] specialMetersAfail = { "فعلن فعلن فعلن فعلن فعلن فعلن فعلن فع",
                                                        "فعلن فعلن فعلن فعلن فعلن فع",
                                                        "فعلن فعلن فعلن فعلن فعلن فعلن فعلن فعلن",
                                                        "فعلن فعلن فعلن فع",
                                                        "فعلن فعلن فعلن فعلن",
                                                        "فعلن فعلن فع",                                                        
                                                        "فعلن فعلن فعلن فعلن فعلن فعلن",
                                                        "فعلن فعلن",
                                                        "فعلن فعلن فعلن فعلن فعلن فعلن فعلن فعلن",
                                                        "فعلن فعلن فعلن فعلن فعلن فعلن",
                                                        "فعلن فعلن فعلن فعلن" };
        static public string[] feet = {"===",
"==-=",
"==-",
"==",
"=-==",
"=-=-",
"=-=",
"=--=",
"=-",
"=",
"-===",
"-==-",
"-==",
"-=-=",
"-=-",
"-=",
"--==",
"--=-=",
"--=-",
"--=",
"-=-==",
"===-",
"-=--=",
"==-=-",
"=-==-",
"=--=-",
"-===-",
"-=-=-",
"--==-",
"--=-=-",
"-=-==-",
"-=--=-"};
        static public string[] feetNames = { "مفعولن",
"مستفعلن",
 "مفعول", 
 "فِعْلن", 
 "فاعلاتن",
 "فاعلاتُ", 
 "فاعلن",
 "مفتَعِلن", 
 "فِعْل", 
 "فِع", 
 "مفاعیلن",
  "مفاعیل",
  "فعولن",
  "مفاعلن",
  "فعول", 
  "فَعَل",
  "فَعِلاتن", 
  "متَفاعلن",
  "فَعِلات", 
  "فَعِلن",
  "مَفاعلاتن",
  "مفعولاتُ",
  "مفاعِلَتن",
  "مستفعلان",
  "فاعلاتان",
   "مفتَعِلان",
  "مفاعیلان",
  "مفاعلان", 
  "فَعِلاتان",
  "متَفاعلان",
  "مَفاعلاتان",
  "مفاعِلَتان"};


        static public string[] metersVeriedNames = { "خفیف مسدّس مخبون محذوف مقطوع", "خفیف مسدّس مخبون محذوف", "رمل مسدّس مخبون محذوف مقطوع", "رمل مسدّس مخبون محذوف",
                                                       "رمل مثمّن مخبون محذوف مقطوع", "رمل مثمّن مخبون محذوف","رمل مسدس مخبون" };
        static public string[] rubaiMeterNames = { "ہزج مثمّن اخرب مکفوف مجبوب", "ہزج مثمّن اخرب مکفوف ابتر", "ہزج مثمّن اخرب مقبوض ابتر", "ہزج مثمّن اخرب مقبوض مکفوف مجبوب",
                                     "ہزج مثمّن اخرم اشتر مکفوف مجبوب", "ہزج مثمّن اخرم اشتر ابتر", "ہزج مثمّن اخرب اخرم ابتر", "ہزج مثمّن اخرب مجبوب","ہزج مثمّن اخرم اخرب مجبوب",
                                     "ہزج مثمّن اخرم ابتر","ہزج مثمّن اخرم اخرب ابتر","ہزج مثمّن اخرم اخرب مکفوف مجبوب"};
        static public string[] specialMeterNames = { "بحرِ ہندی/ متقارب مثمن مضاعف",
                                                       "بحرِ ہندی/ متقارب مسدس مضاعف",
                                                       "بحرِ ہندی/ متقارب اثرم مقبوض محذوف مضاعف",
                                                       "بحرِ ہندی/ متقارب مربع مضاعف",
                                                       "بحرِ ہندی/ متقارب اثرم مقبوض محذوف",
                                                       "بحرِ ہندی/ متقارب مثمن محذوف",
                                                       "بحرِ ہندی/ متقارب مسدس محذوف",
                                                       "بحرِ ہندی/ متقارب مربع محذوف",
                                                       "بحرِ زمزمہ/ متدارک مثمن مضاعف",
                                                       "بحرِ زمزمہ/ متدارک مسدس مضاعف",
                                                       "بحرِ زمزمہ/ متدارک مربع مضاعف" };
        static public string Afail(string meter)
        {
            string ft = "";
            foreach (string s in meter.Split('+'))
            {
                foreach (string foot in s.Split('/'))
                {
                    for (int i = 0; i < feet.Count(); i++)
                    {
                        if (foot.Equals(feet[i]))
                        {
                            ft += " " + feetNames[i];
                        }
                    }
                }
            }
            return ft;
        }

        static public string AfailHindi(string meterName)
        {
            string ft = "";
            for (int i = 0; i < numSpecialMeters; i++)
            {
                if (meterName.Equals(specialMeterNames[i]))
                {
                    ft = specialMetersAfail[i];
                    break;
                }
            }
            return ft;
        }

        static public List<Feet> Afail2(string meter, string code)
        {
            string mete = "", met1 = "", met2 = "", met3 = "", met4 = "";
            bool flag1 = false, flag2 = false, flag3 = false, flag4 = false;
            List<Feet> ft = new List<Feet>();

            met1 = meter.Replace("/", "");
            met2 = met1.Replace("+", "") + "-";
            met3 = met1.Replace("+", "-") + "-";
            met4 = met1.Replace("+", "-");
            met1 = met1.Replace("+", "");

            #region original meter
            if (met1.Length == code.Length)
            {
                for (int j = 0; j < met1.Length; j++)
                {
                    char met = met1[j];
                    char cd = code[j];
                    if (met == '-')
                    {
                        if (cd == '-' || cd == 'x')
                        {

                        }
                        else
                        {
                            flag1 = true;
                            break;
                        }
                    }
                    else if (met == '=')
                    {
                        if (cd == '=' || cd == 'x')
                        {

                        }
                        else
                        {
                            flag1 = true;
                            break;
                        }
                    }
                }
            }
            else
            {
                flag1 = true;
            }

            #endregion
            #region Variation1
            met1 = met2;
            if (met1.Length == code.Length)
            {
                for (int j = 0; j < met1.Length; j++)
                {
                    char met = met1[j];
                    char cd = code[j];
                    if (met == '-')
                    {
                        if (cd == '-' || cd == 'x')
                        {

                        }
                        else
                        {
                            flag2 = true;
                            break;
                        }
                    }
                    else if (met == '=')
                    {
                        if (cd == '=' || cd == 'x')
                        {

                        }
                        else
                        {
                            flag2 = true;
                            break;
                        }
                    }
                }
            }
            else
            {
                flag2 = true;
            }

            #endregion
            #region Variation2
            met1 = met3;
            if (met1.Length == code.Length)
            {
                for (int j = 0; j < met1.Length; j++)
                {
                    char met = met1[j];
                    char cd = code[j];
                    if (met == '-')
                    {
                        if (cd == '-' || cd == 'x')
                        {

                        }
                        else
                        {
                            flag3 = true;
                            break;
                        }
                    }
                    else if (met == '=')
                    {
                        if (cd == '=' || cd == 'x')
                        {

                        }
                        else
                        {
                            flag3 = true;
                            break;
                        }
                    }
                }
            }
            else
            {
                flag3 = true;
            }

            #endregion
            #region Variation3
            met1 = met4;
            if (met1.Length == code.Length)
            {
                for (int j = 0; j < met1.Length; j++)
                {
                    char met = met1[j];
                    char cd = code[j];
                    if (met == '-')
                    {
                        if (cd == '-' || cd == 'x')
                        {

                        }
                        else
                        {
                            flag4 = true;
                            break;
                        }
                    }
                    else if (met == '=')
                    {
                        if (cd == '=' || cd == 'x')
                        {

                        }
                        else
                        {
                            flag4 = true;
                            break;
                        }
                    }
                }
            }
            else
            {
                flag4 = true;
            }

            #endregion

            if (!flag1)
            {
                mete = meter;
            }
            if (!flag2)
            {
                mete = meter + "-";
            }
            if (!flag3)
            {
                mete = meter.Replace("+", "-+") + "-";
            }
            if (!flag4)
            {
                mete = meter.Replace("+", "-+");
            }

            foreach (string s in mete.Split('+'))
            {
                foreach (string foot in s.Split('/'))
                {
                    for (int i = 0; i < feet.Count(); i++)
                    {
                        if (foot.Equals(feet[i]))
                        {
                            Feet temp = new Feet();
                            temp.foot = feetNames[i];
                            temp.code = feet[i];
                            ft.Add(temp);
                        }
                    }
                }
            }

            return ft;
        }

        static public string Rukn(string code)
        {
            string ft = "";
            code = code.Replace("x", "=");
            for (int i = 0; i < feet.Count(); i++)
            {
                if (code.Equals(feet[i]))
                {
                    ft = feetNames[i];
                    return ft;
                }
            }
            return ft;
        }

        static public string RuknCode(string name)
        {
            string ft = "";
            for (int i = 0; i < feetNames.Count(); i++)
            {
                if (name.Trim().Equals(feet[i]))
                {
                    ft = feet[i];
                    return ft;
                }
            }
            return ft;
        }
        static public List<int> meterIndex(string metName)
        {

            List<int> lst = new List<int>();
            for (int i = 0; i < numMeters; i++)
            {
                if (meterNames[i].Equals(metName))
                {
                    lst.Add(i);
                }
            }
            return lst;
        }
    }

}